Revit 2024 API
LinkLoadContent Members
The LinkLoadContent type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from ExternalResourceLoadContent.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLinkDataPath
 Returns the Link data path owned by this LinkLoadContent object.
GetLinkLoadResult
 Retrieves the LinkLoadResult of the attempt to load or reload a Revit link.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetLinkDataPath
 Sets the Link data path owned by this LinkLoadContent object.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ExternalResourceLoadContent.)
LoadStatus
 A value to indicate the status of an external resource load operation. IExternalResourceServers should set this in the LoadResource() method.
 (Inherited from ExternalResourceLoadContent.)
Version
 The version of the external data that the server is providing in this object.
 (Inherited from ExternalResourceLoadContent.)
See Also
LinkLoadContent Class
Autodesk.Revit.DB Namespace